---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IndexBuffer
source: html/186f6b15-38c7-cee7-6163-396cfdea43ee.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexBuffer

A buffer that stores vertex indices for rendering.

## Syntax (C#)
```csharp
public class IndexBuffer : IDisposable
```